#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy_attachment.attach_policy: Refreshing state... [id=app-6-ecs-fargate-secrets-manager-attachment]
data.aws_ssm_parameter.infra_output: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
data.aws_ssm_parameter.infra_output: Read complete after 1s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20240626211313040400000001]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6"
        name                               = "app-6"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:14" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.kms_decrypt_policy will be created
  + resource "aws_iam_policy" "kms_decrypt_policy" {
      + arn         = (known after apply)
      + description = "IAM policy ro decrypt the Secrets Manager secrets"
      + id          = (known after apply)
      + name        = "app-6-kms-decrypt"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (sensitive value)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        }
    }

  # aws_iam_policy_attachment.attach_policy will be destroyed
  # (because aws_iam_policy_attachment.attach_policy is not in configuration)
  - resource "aws_iam_policy_attachment" "attach_policy" {
      - groups     = [] -> null
      - id         = "app-6-ecs-fargate-secrets-manager-attachment" -> null
      - name       = "app-6-ecs-fargate-secrets-manager-attachment" -> null
      - policy_arn = "arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access" -> null
      - roles      = [
          - "app-6-task-role",
        ] -> null
      - users      = [] -> null
    }

  # aws_iam_role_policy_attachment.attach_secrets_read_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_secrets_read_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access"
      + role       = "app-6-task-execution-role"
    }

  # aws_iam_role_policy_attachment.attache_kms_decrypt_policy will be created
  + resource "aws_iam_role_policy_attachment" "attache_kms_decrypt_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-6-task-role"
    }

Plan: 4 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*